t0biasm/embedded-project/platforms/c2000/mcal/f28p65/code/inc/hw_epwm.h
//###########################################################################
//
// FILE:    hw_epwm.h
//
// TITLE:   Definitions for the EPWM registers.
//
//###########################################################################
// 
// C2000Ware v6.00.00.00
//
// Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef HW_EPWM_H
#define HW_EPWM_H

//*************************************************************************************************
//
// The following are defines for the EPWM register offsets
//
//*************************************************************************************************
#define EPWM_O_TBCTL              0x0U    // Time Base Control Register
#define EPWM_O_TBCTL2             0x1U    // Time Base Control Register 2
#define EPWM_O_SYNCINSEL          0x3U    // EPWMxSYNCIN Source Select Register
#define EPWM_O_TBCTR              0x4U    // Time Base Counter Register
#define EPWM_O_TBSTS              0x5U    // Time Base Status Register
#define EPWM_O_SYNCOUTEN          0x6U    // EPWMxSYNCOUT Source Enable Register
#define EPWM_O_TBCTL3             0x7U    // Time Base Control Register 3
#define EPWM_O_CMPCTL             0x8U    // Counter Compare Control Register
#define EPWM_O_CMPCTL2            0x9U    // Counter Compare Control Register 2
#define EPWM_O_DBCTL              0xCU    // Dead-Band Generator Control Register
#define EPWM_O_DBCTL2             0xDU    // Dead-Band Generator Control Register 2
#define EPWM_O_AQCTL              0x10U   // Action Qualifier Control Register
#define EPWM_O_AQTSRCSEL          0x11U   // Action Qualifier Trigger Event Source Select Register
#define EPWM_O_PCCTL              0x14U   // PWM Chopper Control Register
#define EPWM_O_VCAPCTL            0x18U   // Valley Capture Control Register
#define EPWM_O_VCNTCFG            0x19U   // Valley Counter Config Register
#define EPWM_O_HRCNFG             0x20U   // HRPWM Configuration Register
#define EPWM_O_HRCNFG2            0x27U   // HRPWM Configuration 2 Register
#define EPWM_O_HRPCTL             0x2DU   // High Resolution Period Control Register
#define EPWM_O_TRREM              0x2EU   // HRPWM High Resolution Remainder Register
#define EPWM_O_GLDCTL             0x34U   // Global PWM Load Control Register
#define EPWM_O_GLDCFG             0x35U   // Global PWM Load Config Register
#define EPWM_O_XLINK              0x38U   // EPWMx Link Register
#define EPWM_O_XLINK2             0x3AU   // EPWMx Link 2 Register
#define EPWM_O_AQCTLA             0x40U   // Action Qualifier Control Register For Output A
#define EPWM_O_AQCTLA2            0x41U   // Additional Action Qualifier Control Register For
                                          // Output A
#define EPWM_O_AQCTLB             0x42U   // Action Qualifier Control Register For Output B
#define EPWM_O_AQCTLB2            0x43U   // Additional Action Qualifier Control Register For
                                          // Output B
#define EPWM_O_AQSFRC             0x47U   // Action Qualifier Software Force Register
#define EPWM_O_AQCSFRC            0x49U   // Action Qualifier Continuous S/W Force Register
#define EPWM_O_DBREDHR            0x50U   // Dead-Band Generator Rising Edge Delay High Resolution
                                          // Mirror Register
#define EPWM_O_DBRED              0x51U   // Dead-Band Generator Rising Edge Delay High Resolution
                                          // Mirror Register
#define EPWM_O_DBFEDHR            0x52U   // Dead-Band Generator Falling Edge Delay High Resolution
                                          // Register
#define EPWM_O_DBFED              0x53U   // Dead-Band Generator Falling Edge Delay Count Register
#define EPWM_O_TBPHS              0x60U   // Time Base Phase High
#define EPWM_O_TBPRDHR            0x62U   // Time Base Period High Resolution Register
#define EPWM_O_TBPRD              0x63U   // Time Base Period Register
#define EPWM_O_CMPA               0x6AU   // Counter Compare A Register
#define EPWM_O_CMPB               0x6CU   // Compare B Register
#define EPWM_O_CMPC               0x6FU   // Counter Compare C Register
#define EPWM_O_CMPD               0x71U   // Counter Compare D Register
#define EPWM_O_GLDCTL2            0x74U   // Global PWM Load Control Register 2
#define EPWM_O_SWVDELVAL          0x77U   // Software Valley Mode Delay Register
#define EPWM_O_TZSEL              0x80U   // Trip Zone Select Register
#define EPWM_O_TZSEL2             0x81U   // Trip Zone Select Register 2
#define EPWM_O_TZDCSEL            0x82U   // Trip Zone Digital Comparator Select Register
#define EPWM_O_TZCTL              0x84U   // Trip Zone Control Register
#define EPWM_O_TZCTL2             0x85U   // Additional Trip Zone Control Register
#define EPWM_O_TZCTLDCA           0x86U   // Trip Zone Control Register Digital Compare A
#define EPWM_O_TZCTLDCB           0x87U   // Trip Zone Control Register Digital Compare B
#define EPWM_O_TZEINT             0x8DU   // Trip Zone Enable Interrupt Register
#define EPWM_O_TZFLG              0x93U   // Trip Zone Flag Register
#define EPWM_O_TZCBCFLG           0x94U   // Trip Zone CBC Flag Register
#define EPWM_O_TZOSTFLG           0x95U   // Trip Zone OST Flag Register
#define EPWM_O_TZCLR              0x97U   // Trip Zone Clear Register
#define EPWM_O_TZCBCCLR           0x98U   // Trip Zone CBC Clear Register
#define EPWM_O_TZOSTCLR           0x99U   // Trip Zone OST Clear Register
#define EPWM_O_TZFRC              0x9BU   // Trip Zone Force Register
#define EPWM_O_TZTRIPOUTSEL       0x9DU   // Trip Out Select Register
#define EPWM_O_ETSEL              0xA4U   // Event Trigger Selection Register
#define EPWM_O_ETPS               0xA6U   // Event Trigger Pre-Scale Register
#define EPWM_O_ETFLG              0xA8U   // Event Trigger Flag Register
#define EPWM_O_ETCLR              0xAAU   // Event Trigger Clear Register
#define EPWM_O_ETFRC              0xACU   // Event Trigger Force Register
#define EPWM_O_ETINTPS            0xAEU   // Event-Trigger Interrupt Pre-Scale Register
#define EPWM_O_ETSOCPS            0xB0U   // Event-Trigger SOC Pre-Scale Register
#define EPWM_O_ETCNTINITCTL       0xB2U   // Event-Trigger Counter Initialization Control Register
#define EPWM_O_ETCNTINIT          0xB4U   // Event-Trigger Counter Initialization Register
#define EPWM_O_ETINTMIXEN         0xB6U   // Event-Trigger Mixed INT Selection
#define EPWM_O_ETSOCAMIXEN        0xB8U   // Event-Trigger Mixed SOCA Selection
#define EPWM_O_ETSOCBMIXEN        0xBAU   // Event-Trigger Mixed SOCB Selection
#define EPWM_O_DCTRIPSEL          0xC0U   // Digital Compare Trip Select Register
#define EPWM_O_DCACTL             0xC3U   // Digital Compare A Control Register
#define EPWM_O_DCBCTL             0xC4U   // Digital Compare B Control Register
#define EPWM_O_DCFCTL             0xC7U   // Digital Compare Filter Control Register
#define EPWM_O_DCCAPCTL           0xC8U   // Digital Compare Capture Control Register
#define EPWM_O_DCFOFFSET          0xC9U   // Digital Compare Filter Offset Register
#define EPWM_O_DCFOFFSETCNT       0xCAU   // Digital Compare Filter Offset Counter Register
#define EPWM_O_DCFWINDOW          0xCBU   // Digital Compare Filter Window Register
#define EPWM_O_DCFWINDOWCNT       0xCCU   // Digital Compare Filter Window Counter Register
#define EPWM_O_BLANKPULSEMIXSEL   0xCDU   // Blanking window trigger pulse select register
#define EPWM_O_DCCAPMIXSEL        0xCEU   // Capture Event pulse select register
#define EPWM_O_DCCAP              0xCFU   // Digital Compare Counter Capture Register
#define EPWM_O_DCAHTRIPSEL        0xD2U   // Digital Compare AH Trip Select
#define EPWM_O_DCALTRIPSEL        0xD3U   // Digital Compare AL Trip Select
#define EPWM_O_DCBHTRIPSEL        0xD4U   // Digital Compare BH Trip Select
#define EPWM_O_DCBLTRIPSEL        0xD5U   // Digital Compare BL Trip Select
#define EPWM_O_CAPCTL             0xD6U   // Event Capture Control Register
#define EPWM_O_CAPGATETRIPSEL     0xD7U   // Event Capture Gate Trip input select
#define EPWM_O_CAPINTRIPSEL       0xD8U   // Event Capture Trip input select
#define EPWM_O_CAPTRIPSEL         0xD9U   // Event Capture Signal Select
#define EPWM_O_LOCK               0xFAU   // EPWM Lock Register
#define EPWM_O_HWVDELVAL          0xFDU   // Hardware Valley Mode Delay Register
#define EPWM_O_VCNTVAL            0xFEU   // Hardware Valley Counter Register

#define EPWM_O_XCMPCTL1         0x0U    // XCMP Mode Control Register
#define EPWM_O_XLOADCTL         0x8U    // XCMP Mode Load Control Register
#define EPWM_O_XLOAD            0xCU    // XCMP Mode Load Enable Register
#define EPWM_O_XLINKXLOAD       0xEU    // Link register across PWM modules
#define EPWM_O_XREGSHDW1STS     0x10U   // Shadow Buffer 1 Update Status Register
#define EPWM_O_XREGSHDW2STS     0x14U   // Shadow Buffer 2 Update Status Register
#define EPWM_O_XREGSHDW3STS     0x18U   // Shadow Buffer 3 Update Status Register
#define EPWM_O_XCMP1_ACTIVE     0x20U   // Additional Compare 1 Active Register
#define EPWM_O_XCMP2_ACTIVE     0x22U   // Additional Compare 2 Active Register
#define EPWM_O_XCMP3_ACTIVE     0x24U   // Additional Compare 3 Active Register
#define EPWM_O_XCMP4_ACTIVE     0x26U   // Additional Compare 4 Active Register
#define EPWM_O_XCMP5_ACTIVE     0x28U   // Additional Compare 5 Active Register
#define EPWM_O_XCMP6_ACTIVE     0x2AU   // Additional Compare 6 Active Register
#define EPWM_O_XCMP7_ACTIVE     0x2CU   // Additional Compare 7 Active Register
#define EPWM_O_XCMP8_ACTIVE     0x2EU   // Additional Compare 8 Active Register
#define EPWM_O_XTBPRD_ACTIVE    0x30U   // Additional Time Base Period Active Register
#define EPWM_O_XAQCTLA_ACTIVE   0x34U   // AQCTLA Active Register
#define EPWM_O_XAQCTLB_ACTIVE   0x35U   // AQCTLB Active Register
#define EPWM_O_XMINMAX_ACTIVE   0x3EU   // XMINMAX Active Register
#define EPWM_O_XCMP1_SHDW1      0x40U   // Additional Compare 1 Shadow 1 Register
#define EPWM_O_XCMP2_SHDW1      0x42U   // Additional Compare 2 Shadow 1 Register
#define EPWM_O_XCMP3_SHDW1      0x44U   // Additional Compare 3 Shadow 1 Register
#define EPWM_O_XCMP4_SHDW1      0x46U   // Additional Compare 4 Shadow 1 Register
#define EPWM_O_XCMP5_SHDW1      0x48U   // Additional Compare 5 Shadow 1 Register
#define EPWM_O_XCMP6_SHDW1      0x4AU   // Additional Compare 6 Shadow 1 Register
#define EPWM_O_XCMP7_SHDW1      0x4CU   // Additional Compare 7 Shadow 1 Register
#define EPWM_O_XCMP8_SHDW1      0x4EU   // Additional Compare 8 Shadow 1 Register
#define EPWM_O_XTBPRD_SHDW1     0x50U   // Additional Time Base Period Shadow 1 Register
#define EPWM_O_XAQCTLA_SHDW1    0x54U   // XAQCTLA Shadow 1 Register
#define EPWM_O_XAQCTLB_SHDW1    0x55U   // XAQCTLB Shadow 1 Register
#define EPWM_O_CMPC_SHDW1       0x57U   // CMPC Shadow 1 Register
#define EPWM_O_CMPD_SHDW1       0x59U   // CMPD Shadow 1 Register
#define EPWM_O_XMINMAX_SHDW1    0x5EU   // XMINMAX Shadow 1 Register
#define EPWM_O_XCMP1_SHDW2      0x60U   // Additional Compare 1 Shadow 2 Register
#define EPWM_O_XCMP2_SHDW2      0x62U   // Additional Compare 2 Shadow 2 Register
#define EPWM_O_XCMP3_SHDW2      0x64U   // Additional Compare 3 Shadow 2 Register
#define EPWM_O_XCMP4_SHDW2      0x66U   // Additional Compare 4 Shadow 2 Register
#define EPWM_O_XCMP5_SHDW2      0x68U   // Additional Compare 5 Shadow 2 Register
#define EPWM_O_XCMP6_SHDW2      0x6AU   // Additional Compare 6 Shadow 2 Register
#define EPWM_O_XCMP7_SHDW2      0x6CU   // Additional Compare 7 Shadow 2 Register
#define EPWM_O_XCMP8_SHDW2      0x6EU   // Additional Compare 8 Shadow 2 Register
#define EPWM_O_XTBPRD_SHDW2     0x70U   // Additional Time Base Period Shadow 2 Register
#define EPWM_O_XAQCTLA_SHDW2    0x74U   // XAQCTLA Shadow 2 Register
#define EPWM_O_XAQCTLB_SHDW2    0x75U   // XAQCTLB Shadow 2 Register
#define EPWM_O_CMPC_SHDW2       0x77U   // CMPC Shadow 2 Register
#define EPWM_O_CMPD_SHDW2       0x79U   // CMPD Shadow 2 Register
#define EPWM_O_XMINMAX_SHDW2    0x7EU   // XMINMAX Shadow 2 Register
#define EPWM_O_XCMP1_SHDW3      0x80U   // Additional Compare 1 Shadow 3 Register
#define EPWM_O_XCMP2_SHDW3      0x82U   // Additional Compare 2 Shadow 3 Register
#define EPWM_O_XCMP3_SHDW3      0x84U   // Additional Compare 3 Shadow 3 Register
#define EPWM_O_XCMP4_SHDW3      0x86U   // Additional Compare 4 Shadow 3 Register
#define EPWM_O_XCMP5_SHDW3      0x88U   // Additional Compare 5 Shadow 3 Register
#define EPWM_O_XCMP6_SHDW3      0x8AU   // Additional Compare 6 Shadow 3 Register
#define EPWM_O_XCMP7_SHDW3      0x8CU   // Additional Compare 7 Shadow 3 Register
#define EPWM_O_XCMP8_SHDW3      0x8EU   // Additional Compare 8 Shadow 3 Register
#define EPWM_O_XTBPRD_SHDW3     0x90U   // Additional Time Base Period Shadow 3 Register
#define EPWM_O_XAQCTLA_SHDW3    0x94U   // XAQCTLA Shadow 3 Register
#define EPWM_O_XAQCTLB_SHDW3    0x95U   // XAQCTLB Shadow 3 Register
#define EPWM_O_CMPC_SHDW3       0x97U   // CMPC Shadow 3 Register
#define EPWM_O_CMPD_SHDW3       0x99U   // CMPD Shadow 3 Register
#define EPWM_O_XMINMAX_SHDW3    0x9EU   // XMINMAX Shadow 3 Register

#define EPWM_O_DECTL        0x0U    // DE control register
#define EPWM_O_DECOMPSEL    0x2U    // DE comparator source select register
#define EPWM_O_DEACTCTL     0x4U    // DE Action Control
#define EPWM_O_DESTS        0x6U    // DE Status register
#define EPWM_O_DEFRC        0x8U    // DE Status force register
#define EPWM_O_DECLR        0xAU    // DE Status clear register
#define EPWM_O_DEMONCNT     0x10U   // DE trip monitor counter
#define EPWM_O_DEMONCTL     0x12U   // DE monitor mode control
#define EPWM_O_DEMONSTEP    0x14U   // DE monitor counter step
#define EPWM_O_DEMONTHRES   0x16U   // DE monitor counter threshold

#define EPWM_O_MINDBCFG   0x0U    // Minimum dead band configuration register.
#define EPWM_O_MINDBDLY   0x2U    // Minimum dead band delay register
#define EPWM_O_LUTCTLA    0x10U   // LUT control register on PWMA
#define EPWM_O_LUTCTLB    0x12U   // LUT control register on PWMB


//*************************************************************************************************
//
// The following are defines for the bit fields in the TBCTL register
//
//*************************************************************************************************
#define EPWM_TBCTL_CTRMODE_S     0U
#define EPWM_TBCTL_CTRMODE_M     0x3U      // Counter Mode
#define EPWM_TBCTL_PHSEN         0x4U      // Phase Load Enable
#define EPWM_TBCTL_PRDLD         0x8U      // Active Period Load
#define EPWM_TBCTL_SWFSYNC       0x40U     // Software Force Sync Pulse
#define EPWM_TBCTL_HSPCLKDIV_S   7U
#define EPWM_TBCTL_HSPCLKDIV_M   0x380U    // High Speed TBCLK Pre-scaler
#define EPWM_TBCTL_CLKDIV_S      10U
#define EPWM_TBCTL_CLKDIV_M      0x1C00U   // Time Base Clock Pre-scaler
#define EPWM_TBCTL_PHSDIR        0x2000U   // Phase Direction Bit
#define EPWM_TBCTL_FREE_SOFT_S   14U
#define EPWM_TBCTL_FREE_SOFT_M   0xC000U   // Emulation Mode Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the TBCTL2 register
//
//*************************************************************************************************
#define EPWM_TBCTL2_OSHTSYNCMODE   0x40U     // One shot sync mode
#define EPWM_TBCTL2_OSHTSYNC       0x80U     // One shot sync
#define EPWM_TBCTL2_PRDLDSYNC_S    14U
#define EPWM_TBCTL2_PRDLDSYNC_M    0xC000U   // PRD Shadow to Active Load on SYNC Event

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWMSYNCINSEL register
//
//*************************************************************************************************
#define EPWM_SYNCINSEL_SEL_S   0U
#define EPWM_SYNCINSEL_SEL_M   0x7FU   // EPWMxSYNCI source select

//*************************************************************************************************
//
// The following are defines for the bit fields in the TBSTS register
//
//*************************************************************************************************
#define EPWM_TBSTS_CTRDIR   0x1U   // Counter Direction Status
#define EPWM_TBSTS_SYNCI    0x2U   // External Input Sync Status
#define EPWM_TBSTS_CTRMAX   0x4U   // Counter Max Latched Status

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWMSYNCOUTEN register
//
//*************************************************************************************************
#define EPWM_SYNCOUTEN_SWEN        0x1U    // EPWMxSYNCO Software Force Enable
#define EPWM_SYNCOUTEN_ZEROEN      0x2U    // EPWMxSYNCO Zero Count Event Enable
#define EPWM_SYNCOUTEN_CMPBEN      0x4U    // EPWMxSYNCO Compare B Event Enable
#define EPWM_SYNCOUTEN_CMPCEN      0x8U    // EPWMxSYNCO Compare C Event Enable
#define EPWM_SYNCOUTEN_CMPDEN      0x10U   // EPWMxSYNCO Compare D Event Enable
#define EPWM_SYNCOUTEN_DCAEVT1EN   0x20U   // EPWMxSYNCO Digital Compare A Event 1 Sync Enable
#define EPWM_SYNCOUTEN_DCBEVT1EN   0x40U   // EPWMxSYNCO Digital Compare B Event 1 Sync Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the TBCTL3 register
//
//*************************************************************************************************
#define EPWM_TBCTL3_OSSFRCEN   0x1U   // One Shot Sync Force Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMPCTL register
//
//*************************************************************************************************
#define EPWM_CMPCTL_LOADAMODE_S   0U
#define EPWM_CMPCTL_LOADAMODE_M   0x3U      // Active Compare A Load
#define EPWM_CMPCTL_LOADBMODE_S   2U
#define EPWM_CMPCTL_LOADBMODE_M   0xCU      // Active Compare B Load
#define EPWM_CMPCTL_SHDWAMODE     0x10U     // Compare A Register Block Operating Mode
#define EPWM_CMPCTL_SHDWBMODE     0x40U     // Compare B Register Block Operating Mode
#define EPWM_CMPCTL_SHDWAFULL     0x100U    // Compare A Shadow Register Full Status
#define EPWM_CMPCTL_SHDWBFULL     0x200U    // Compare B Shadow Register Full Status
#define EPWM_CMPCTL_LOADASYNC_S   10U
#define EPWM_CMPCTL_LOADASYNC_M   0xC00U    // Active Compare A Load on SYNC
#define EPWM_CMPCTL_LOADBSYNC_S   12U
#define EPWM_CMPCTL_LOADBSYNC_M   0x3000U   // Active Compare B Load on SYNC
#define EPWM_CMPCTL_LINKDUTYHR    0x8000U   // Enable same values on CMPAHR/CMPBHR

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMPCTL2 register
//
//*************************************************************************************************
#define EPWM_CMPCTL2_LOADCMODE_S   0U
#define EPWM_CMPCTL2_LOADCMODE_M   0x3U      // Active Compare C Load
#define EPWM_CMPCTL2_LOADDMODE_S   2U
#define EPWM_CMPCTL2_LOADDMODE_M   0xCU      // Active Compare D load
#define EPWM_CMPCTL2_SHDWCMODE     0x10U     // Compare C Block Operating Mode
#define EPWM_CMPCTL2_SHDWDMODE     0x40U     // Compare D Block Operating Mode
#define EPWM_CMPCTL2_LOADCSYNC_S   10U
#define EPWM_CMPCTL2_LOADCSYNC_M   0xC00U    // Active Compare C Load on SYNC
#define EPWM_CMPCTL2_LOADDSYNC_S   12U
#define EPWM_CMPCTL2_LOADDSYNC_M   0x3000U   // Active Compare D Load on SYNC

//*************************************************************************************************
//
// The following are defines for the bit fields in the DBCTL register
//
//*************************************************************************************************
#define EPWM_DBCTL_OUT_MODE_S      0U
#define EPWM_DBCTL_OUT_MODE_M      0x3U      // Dead Band Output Mode Control
#define EPWM_DBCTL_POLSEL_S        2U
#define EPWM_DBCTL_POLSEL_M        0xCU      // Polarity Select Control
#define EPWM_DBCTL_IN_MODE_S       4U
#define EPWM_DBCTL_IN_MODE_M       0x30U     // Dead Band Input Select Mode Control
#define EPWM_DBCTL_LOADREDMODE_S   6U
#define EPWM_DBCTL_LOADREDMODE_M   0xC0U     // Active DBRED Load Mode
#define EPWM_DBCTL_LOADFEDMODE_S   8U
#define EPWM_DBCTL_LOADFEDMODE_M   0x300U    // Active DBFED Load Mode
#define EPWM_DBCTL_SHDWDBREDMODE   0x400U    // DBRED Block Operating Mode
#define EPWM_DBCTL_SHDWDBFEDMODE   0x800U    // DBFED Block Operating Mode
#define EPWM_DBCTL_OUTSWAP_S       12U
#define EPWM_DBCTL_OUTSWAP_M       0x3000U   // Dead Band Output Swap Control
#define EPWM_DBCTL_DEDB_MODE       0x4000U   // Dead Band Dual-Edge B Mode Control
#define EPWM_DBCTL_HALFCYCLE       0x8000U   // Half Cycle Clocking Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the DBCTL2 register
//
//*************************************************************************************************
#define EPWM_DBCTL2_LOADDBCTLMODE_S   0U
#define EPWM_DBCTL2_LOADDBCTLMODE_M   0x3U   // DBCTL Load from Shadow Mode Select
#define EPWM_DBCTL2_SHDWDBCTLMODE     0x4U   // DBCTL Load mode Select

