t0biasm/embedded-project/platforms/c2000/mcal/f28p65/code/inc/hw_epwm.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the AQCTL register
//
//*************************************************************************************************
#define EPWM_AQCTL_LDAQAMODE_S   0U
#define EPWM_AQCTL_LDAQAMODE_M   0x3U     // Action Qualifier A Load Select
#define EPWM_AQCTL_LDAQBMODE_S   2U
#define EPWM_AQCTL_LDAQBMODE_M   0xCU     // Action Qualifier B Load Select
#define EPWM_AQCTL_SHDWAQAMODE   0x10U    // Action Qualifer A Operating Mode
#define EPWM_AQCTL_SHDWAQBMODE   0x40U    // Action Qualifier B Operating Mode
#define EPWM_AQCTL_LDAQASYNC_S   8U
#define EPWM_AQCTL_LDAQASYNC_M   0x300U   // AQCTLA Register Load on SYNC
#define EPWM_AQCTL_LDAQBSYNC_S   10U
#define EPWM_AQCTL_LDAQBSYNC_M   0xC00U   // AQCTLB Register Load on SYNC

//*************************************************************************************************
//
// The following are defines for the bit fields in the AQTSRCSEL register
//
//*************************************************************************************************
#define EPWM_AQTSRCSEL_T1SEL_S   0U
#define EPWM_AQTSRCSEL_T1SEL_M   0xFU    // T1 Event Source Select Bits
#define EPWM_AQTSRCSEL_T2SEL_S   4U
#define EPWM_AQTSRCSEL_T2SEL_M   0xF0U   // T2 Event Source Select Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCCTL register
//
//*************************************************************************************************
#define EPWM_PCCTL_CHPEN       0x1U     // PWM chopping enable
#define EPWM_PCCTL_OSHTWTH_S   1U
#define EPWM_PCCTL_OSHTWTH_M   0x1EU    // One-shot pulse width
#define EPWM_PCCTL_CHPFREQ_S   5U
#define EPWM_PCCTL_CHPFREQ_M   0xE0U    // Chopping clock frequency
#define EPWM_PCCTL_CHPDUTY_S   8U
#define EPWM_PCCTL_CHPDUTY_M   0x700U   // Chopping clock Duty cycle

//*************************************************************************************************
//
// The following are defines for the bit fields in the VCAPCTL register
//
//*************************************************************************************************
#define EPWM_VCAPCTL_VCAPE            0x1U     // Valley  Capture mode
#define EPWM_VCAPCTL_VCAPSTART        0x2U     // Valley  Capture Start
#define EPWM_VCAPCTL_TRIGSEL_S        2U
#define EPWM_VCAPCTL_TRIGSEL_M        0x1CU    // Capture Trigger Select
#define EPWM_VCAPCTL_VDELAYDIV_S      7U
#define EPWM_VCAPCTL_VDELAYDIV_M      0x380U   // Valley Delay Mode Divide Enable
#define EPWM_VCAPCTL_EDGEFILTDLYSEL   0x400U   // Valley Switching Mode Delay Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the VCNTCFG register
//
//*************************************************************************************************
#define EPWM_VCNTCFG_STARTEDGE_S    0U
#define EPWM_VCNTCFG_STARTEDGE_M    0xFU      // Counter Start Edge Selection
#define EPWM_VCNTCFG_STARTEDGESTS   0x80U     // Start Edge Status Bit
#define EPWM_VCNTCFG_STOPEDGE_S     8U
#define EPWM_VCNTCFG_STOPEDGE_M     0xF00U    // Counter Start Edge Selection
#define EPWM_VCNTCFG_STOPEDGESTS    0x8000U   // Stop Edge Status Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the HRCNFG register
//
//*************************************************************************************************
#define EPWM_HRCNFG_EDGMODE_S    0U
#define EPWM_HRCNFG_EDGMODE_M    0x3U      // ePWMxA Edge Mode Select Bits
#define EPWM_HRCNFG_CTLMODE      0x4U      // ePWMxA Control Mode Select Bits
#define EPWM_HRCNFG_HRLOAD_S     3U
#define EPWM_HRCNFG_HRLOAD_M     0x18U     // ePWMxA Shadow Mode Select Bits
#define EPWM_HRCNFG_SELOUTB      0x20U     // EPWMB Output Selection Bit
#define EPWM_HRCNFG_AUTOCONV     0x40U     // Autoconversion Bit
#define EPWM_HRCNFG_SWAPAB       0x80U     // Swap EPWMA and EPWMB Outputs Bit
#define EPWM_HRCNFG_EDGMODEB_S   8U
#define EPWM_HRCNFG_EDGMODEB_M   0x300U    // ePWMxB Edge Mode Select Bits
#define EPWM_HRCNFG_CTLMODEB     0x400U    // ePWMxB Control Mode Select Bits
#define EPWM_HRCNFG_HRLOADB_S    11U
#define EPWM_HRCNFG_HRLOADB_M    0x1800U   // ePWMxB Shadow Mode Select Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the HRCNFG2 register
//
//*************************************************************************************************
#define EPWM_HRCNFG2_EDGMODEDB_S      0U
#define EPWM_HRCNFG2_EDGMODEDB_M      0x3U    // Dead-Band Edge-Mode Select Bits
#define EPWM_HRCNFG2_CTLMODEDBRED_S   2U
#define EPWM_HRCNFG2_CTLMODEDBRED_M   0xCU    // DBRED Control Mode Select Bits
#define EPWM_HRCNFG2_CTLMODEDBFED_S   4U
#define EPWM_HRCNFG2_CTLMODEDBFED_M   0x30U   // DBFED Control Mode Select Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the HRPCTL register
//
//*************************************************************************************************
#define EPWM_HRPCTL_HRPE            0x1U    // High Resolution Period Enable
#define EPWM_HRPCTL_PWMSYNCSEL      0x2U    // EPWMSYNCPER Source Select
#define EPWM_HRPCTL_TBPHSHRLOADE    0x4U    // TBPHSHR Load Enable
#define EPWM_HRPCTL_PWMSYNCSELX_S   4U
#define EPWM_HRPCTL_PWMSYNCSELX_M   0x70U   // EPWMSYNCPER Extended Source Select Bit:

//*************************************************************************************************
//
// The following are defines for the bit fields in the TRREM register
//
//*************************************************************************************************
#define EPWM_TRREM_TRREM_S   0U
#define EPWM_TRREM_TRREM_M   0x7FFU   // HRPWM Remainder Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the GLDCTL register
//
//*************************************************************************************************
#define EPWM_GLDCTL_GLD         0x1U      // Global Shadow to Active load event control
#define EPWM_GLDCTL_GLDMODE_S   1U
#define EPWM_GLDCTL_GLDMODE_M   0x1EU     // Shadow to Active Global Load Pulse Selection
#define EPWM_GLDCTL_OSHTMODE    0x20U     // One Shot Load mode control bit
#define EPWM_GLDCTL_GLDPRD_S    7U
#define EPWM_GLDCTL_GLDPRD_M    0x380U    // Global Load Strobe Period Select Register
#define EPWM_GLDCTL_GLDCNT_S    10U
#define EPWM_GLDCTL_GLDCNT_M    0x1C00U   // Global Load Strobe Counter Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the GLDCFG register
//
//*************************************************************************************************
#define EPWM_GLDCFG_TBPRD_TBPRDHR    0x1U     // Global load event configuration for TBPRD:TBPRDHR
#define EPWM_GLDCFG_CMPA_CMPAHR      0x2U     // Global load event configuration for CMPA:CMPAHR
#define EPWM_GLDCFG_CMPB_CMPBHR      0x4U     // Global load event configuration for CMPB:CMPBHR
#define EPWM_GLDCFG_CMPC             0x8U     // Global load event configuration for CMPC
#define EPWM_GLDCFG_CMPD             0x10U    // Global load event configuration for CMPD
#define EPWM_GLDCFG_DBRED_DBREDHR    0x20U    // Global load event configuration for DBRED:DBREDHR
#define EPWM_GLDCFG_DBFED_DBFEDHR    0x40U    // Global load event configuration for DBFED:DBFEDHR
#define EPWM_GLDCFG_DBCTL            0x80U    // Global load event configuration for DBCTL
#define EPWM_GLDCFG_AQCTLA_AQCTLA2   0x100U   // Global load event configuration for AQCTLA/A2
#define EPWM_GLDCFG_AQCTLB_AQCTLB2   0x200U   // Global load event configuration for AQCTLB/B2
#define EPWM_GLDCFG_AQCSFRC          0x400U   // Global load event configuration for AQCSFRC

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWMXLINK register
//
//*************************************************************************************************
#define EPWM_XLINK_TBPRDLINK_S     0U
#define EPWM_XLINK_TBPRDLINK_M     0x1FU         // TBPRD:TBPRDHR  Link
#define EPWM_XLINK_CMPALINK_S      5U
#define EPWM_XLINK_CMPALINK_M      0x3E0U        // CMPA:CMPAHR Link
#define EPWM_XLINK_CMPBLINK_S      10U
#define EPWM_XLINK_CMPBLINK_M      0x7C00U       // CMPB:CMPBHR Link
#define EPWM_XLINK_CMPCLINK_S      16U
#define EPWM_XLINK_CMPCLINK_M      0x1F0000U     // CMPC Link
#define EPWM_XLINK_CMPDLINK_S      21U
#define EPWM_XLINK_CMPDLINK_M      0x3E00000U    // CMPD Link
#define EPWM_XLINK_GLDCTL2LINK_S   26U
#define EPWM_XLINK_GLDCTL2LINK_M   0x7C000000U   // GLDCTL2 Link

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWMXLINK2 register
//
//*************************************************************************************************
#define EPWM_XLINK2_DBREDLINK_S   0U
#define EPWM_XLINK2_DBREDLINK_M   0x1FU    // DBRED:DBREDHR Link
#define EPWM_XLINK2_DBFEDLINK_S   5U
#define EPWM_XLINK2_DBFEDLINK_M   0x3E0U   // DBFED:DBFEDHR Link

//*************************************************************************************************
//
// The following are defines for the bit fields in the AQCTLA register
//
//*************************************************************************************************
#define EPWM_AQCTLA_ZRO_S   0U
#define EPWM_AQCTLA_ZRO_M   0x3U     // Action Counter = Zero
#define EPWM_AQCTLA_PRD_S   2U
#define EPWM_AQCTLA_PRD_M   0xCU     // Action Counter = Period
#define EPWM_AQCTLA_CAU_S   4U
#define EPWM_AQCTLA_CAU_M   0x30U    // Action Counter = Compare A Up
#define EPWM_AQCTLA_CAD_S   6U
#define EPWM_AQCTLA_CAD_M   0xC0U    // Action Counter = Compare A Down
#define EPWM_AQCTLA_CBU_S   8U
#define EPWM_AQCTLA_CBU_M   0x300U   // Action Counter = Compare B Up
#define EPWM_AQCTLA_CBD_S   10U
#define EPWM_AQCTLA_CBD_M   0xC00U   // Action Counter = Compare B Down

//*************************************************************************************************
//
// The following are defines for the bit fields in the AQCTLA2 register
//
//*************************************************************************************************
#define EPWM_AQCTLA2_T1U_S   0U
#define EPWM_AQCTLA2_T1U_M   0x3U    // Action when event occurs on T1 in UP-Count
#define EPWM_AQCTLA2_T1D_S   2U
#define EPWM_AQCTLA2_T1D_M   0xCU    // Action when event occurs on T1 in DOWN-Count
#define EPWM_AQCTLA2_T2U_S   4U
#define EPWM_AQCTLA2_T2U_M   0x30U   // Action when event occurs on T2 in UP-Count
#define EPWM_AQCTLA2_T2D_S   6U
#define EPWM_AQCTLA2_T2D_M   0xC0U   // Action when event occurs on T2 in DOWN-Count

//*************************************************************************************************
//
// The following are defines for the bit fields in the AQCTLB register
//
//*************************************************************************************************
#define EPWM_AQCTLB_ZRO_S   0U
#define EPWM_AQCTLB_ZRO_M   0x3U     // Action Counter = Zero
#define EPWM_AQCTLB_PRD_S   2U
#define EPWM_AQCTLB_PRD_M   0xCU     // Action Counter = Period
#define EPWM_AQCTLB_CAU_S   4U
#define EPWM_AQCTLB_CAU_M   0x30U    // Action Counter = Compare A Up
#define EPWM_AQCTLB_CAD_S   6U
#define EPWM_AQCTLB_CAD_M   0xC0U    // Action Counter = Compare A Down
#define EPWM_AQCTLB_CBU_S   8U
#define EPWM_AQCTLB_CBU_M   0x300U   // Action Counter = Compare B Up
#define EPWM_AQCTLB_CBD_S   10U
#define EPWM_AQCTLB_CBD_M   0xC00U   // Action Counter = Compare B Down

//*************************************************************************************************
//
// The following are defines for the bit fields in the AQCTLB2 register
//
//*************************************************************************************************
#define EPWM_AQCTLB2_T1U_S   0U
#define EPWM_AQCTLB2_T1U_M   0x3U    // Action when event occurs on T1 in UP-Count
#define EPWM_AQCTLB2_T1D_S   2U
#define EPWM_AQCTLB2_T1D_M   0xCU    // Action when event occurs on T1 in DOWN-Count
#define EPWM_AQCTLB2_T2U_S   4U
#define EPWM_AQCTLB2_T2U_M   0x30U   // Action when event occurs on T2 in UP-Count
#define EPWM_AQCTLB2_T2D_S   6U
#define EPWM_AQCTLB2_T2D_M   0xC0U   // Action when event occurs on T2 in DOWN-Count

//*************************************************************************************************
//
// The following are defines for the bit fields in the AQSFRC register
//
//*************************************************************************************************
#define EPWM_AQSFRC_ACTSFA_S   0U
#define EPWM_AQSFRC_ACTSFA_M   0x3U    // Action when One-time SW Force A Invoked
#define EPWM_AQSFRC_OTSFA      0x4U    // One-time SW Force A Output
#define EPWM_AQSFRC_ACTSFB_S   3U
#define EPWM_AQSFRC_ACTSFB_M   0x18U   // Action when One-time SW Force B Invoked
#define EPWM_AQSFRC_OTSFB      0x20U   // One-time SW Force A Output
#define EPWM_AQSFRC_RLDCSF_S   6U
#define EPWM_AQSFRC_RLDCSF_M   0xC0U   // Reload from Shadow Options

//*************************************************************************************************
//
// The following are defines for the bit fields in the AQCSFRC register
//
//*************************************************************************************************
#define EPWM_AQCSFRC_CSFA_S   0U
#define EPWM_AQCSFRC_CSFA_M   0x3U   // Continuous Software Force on output A
#define EPWM_AQCSFRC_CSFB_S   2U
#define EPWM_AQCSFRC_CSFB_M   0xCU   // Continuous Software Force on output B

//*************************************************************************************************
//
// The following are defines for the bit fields in the DBREDHR register
//
//*************************************************************************************************
#define EPWM_DBREDHR_DBREDHR_S   9U
#define EPWM_DBREDHR_DBREDHR_M   0xFE00U   // DBREDHR High Resolution Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the DBRED register
//
//*************************************************************************************************
#define EPWM_DBRED_DBRED_S   0U
#define EPWM_DBRED_DBRED_M   0x3FFFU   // Rising edge delay value

//*************************************************************************************************
//
// The following are defines for the bit fields in the DBFEDHR register
//
//*************************************************************************************************
#define EPWM_DBFEDHR_DBFEDHR_S   9U
#define EPWM_DBFEDHR_DBFEDHR_M   0xFE00U   // DBFEDHR High Resolution Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the DBFED register
//
//*************************************************************************************************
#define EPWM_DBFED_DBFED_S   0U
#define EPWM_DBFED_DBFED_M   0x3FFFU   // Falling edge delay value

//*************************************************************************************************
//
// The following are defines for the bit fields in the TBPHS register
//
//*************************************************************************************************
#define EPWM_TBPHS_TBPHSHR_S   0U
#define EPWM_TBPHS_TBPHSHR_M   0xFFFFU       // Extension Register for HRPWM Phase (8-bits)
#define EPWM_TBPHS_TBPHS_S     16U
#define EPWM_TBPHS_TBPHS_M     0xFFFF0000U   // Phase Offset Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMPA register
//
//*************************************************************************************************
#define EPWM_CMPA_CMPAHR_S   0U
#define EPWM_CMPA_CMPAHR_M   0xFFFFU       // Compare A HRPWM Extension Register
#define EPWM_CMPA_CMPA_S     16U
#define EPWM_CMPA_CMPA_M     0xFFFF0000U   // Compare A Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMPB register
//
//*************************************************************************************************
#define EPWM_CMPB_CMPBHR_S   0U
#define EPWM_CMPB_CMPBHR_M   0xFFFFU       // Compare B High Resolution Bits
#define EPWM_CMPB_CMPB_S     16U
#define EPWM_CMPB_CMPB_M     0xFFFF0000U   // Compare B Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the GLDCTL2 register
//
//*************************************************************************************************
#define EPWM_GLDCTL2_OSHTLD   0x1U   // Enable reload event in one shot mode
#define EPWM_GLDCTL2_GFRCLD   0x2U   // Force reload event in one shot mode

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZSEL register
//
//*************************************************************************************************
#define EPWM_TZSEL_CBC1      0x1U      // TZ1 CBC select
#define EPWM_TZSEL_CBC2      0x2U      // TZ2 CBC select
#define EPWM_TZSEL_CBC3      0x4U      // TZ3 CBC select
#define EPWM_TZSEL_CBC4      0x8U      // TZ4 CBC select
#define EPWM_TZSEL_CBC5      0x10U     // TZ5 CBC select
#define EPWM_TZSEL_CBC6      0x20U     // TZ6 CBC select
#define EPWM_TZSEL_DCAEVT2   0x40U     // DCAEVT2 CBC select
#define EPWM_TZSEL_DCBEVT2   0x80U     // DCBEVT2 CBC select
#define EPWM_TZSEL_OSHT1     0x100U    // One-shot TZ1 select
#define EPWM_TZSEL_OSHT2     0x200U    // One-shot TZ2 select
#define EPWM_TZSEL_OSHT3     0x400U    // One-shot TZ3 select
#define EPWM_TZSEL_OSHT4     0x800U    // One-shot TZ4 select
#define EPWM_TZSEL_OSHT5     0x1000U   // One-shot TZ5 select
#define EPWM_TZSEL_OSHT6     0x2000U   // One-shot TZ6 select
#define EPWM_TZSEL_DCAEVT1   0x4000U   // One-shot DCAEVT1 select
#define EPWM_TZSEL_DCBEVT1   0x8000U   // One-shot DCBEVT1 select

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZSEL2 register
//
//*************************************************************************************************
#define EPWM_TZSEL2_CAPEVTCBC   0x1U     // CAPEVT CBC select
#define EPWM_TZSEL2_CAPEVTOST   0x100U   // CAPEVT One-shot select

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZDCSEL register
//
//*************************************************************************************************
#define EPWM_TZDCSEL_DCAEVT1_S   0U
#define EPWM_TZDCSEL_DCAEVT1_M   0x7U     // Digital Compare Output A Event 1
#define EPWM_TZDCSEL_DCAEVT2_S   3U
#define EPWM_TZDCSEL_DCAEVT2_M   0x38U    // Digital Compare Output A Event 2
#define EPWM_TZDCSEL_DCBEVT1_S   6U
#define EPWM_TZDCSEL_DCBEVT1_M   0x1C0U   // Digital Compare Output B Event 1
#define EPWM_TZDCSEL_DCBEVT2_S   9U
#define EPWM_TZDCSEL_DCBEVT2_M   0xE00U   // Digital Compare Output B Event 2

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZCTL register
//
//*************************************************************************************************
#define EPWM_TZCTL_TZA_S       0U
#define EPWM_TZCTL_TZA_M       0x3U     // TZ1 to TZ6 Trip Action On EPWMxA
#define EPWM_TZCTL_TZB_S       2U
#define EPWM_TZCTL_TZB_M       0xCU     // TZ1 to TZ6 Trip Action On EPWMxB
#define EPWM_TZCTL_DCAEVT1_S   4U
#define EPWM_TZCTL_DCAEVT1_M   0x30U    // EPWMxA action on DCAEVT1
#define EPWM_TZCTL_DCAEVT2_S   6U
#define EPWM_TZCTL_DCAEVT2_M   0xC0U    // EPWMxA action on DCAEVT2
#define EPWM_TZCTL_DCBEVT1_S   8U
#define EPWM_TZCTL_DCBEVT1_M   0x300U   // EPWMxB action on DCBEVT1
#define EPWM_TZCTL_DCBEVT2_S   10U
#define EPWM_TZCTL_DCBEVT2_M   0xC00U   // EPWMxB action on DCBEVT2

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZCTL2 register
//
//*************************************************************************************************
#define EPWM_TZCTL2_TZAU_S   0U
#define EPWM_TZCTL2_TZAU_M   0x7U      // Trip Action On EPWMxA while Count direction is UP
#define EPWM_TZCTL2_TZAD_S   3U
#define EPWM_TZCTL2_TZAD_M   0x38U     // Trip Action On EPWMxA while Count direction is DOWN
#define EPWM_TZCTL2_TZBU_S   6U
#define EPWM_TZCTL2_TZBU_M   0x1C0U    // Trip Action On EPWMxB while Count direction is UP
#define EPWM_TZCTL2_TZBD_S   9U
#define EPWM_TZCTL2_TZBD_M   0xE00U    // Trip Action On EPWMxB while Count direction is DOWN
#define EPWM_TZCTL2_ETZE     0x8000U   // TZCTL2 Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZCTLDCA register
//
//*************************************************************************************************
#define EPWM_TZCTLDCA_DCAEVT1U_S   0U
#define EPWM_TZCTLDCA_DCAEVT1U_M   0x7U     // DCAEVT1 Action On EPWMxA while Count direction is UP
#define EPWM_TZCTLDCA_DCAEVT1D_S   3U
#define EPWM_TZCTLDCA_DCAEVT1D_M   0x38U    // DCAEVT1 Action On EPWMxA while Count direction is
                                            // DOWN
#define EPWM_TZCTLDCA_DCAEVT2U_S   6U
#define EPWM_TZCTLDCA_DCAEVT2U_M   0x1C0U   // DCAEVT2 Action On EPWMxA while Count direction is UP
#define EPWM_TZCTLDCA_DCAEVT2D_S   9U
#define EPWM_TZCTLDCA_DCAEVT2D_M   0xE00U   // DCAEVT2 Action On EPWMxA while Count direction is
                                            // DOWN

