t0biasm/embedded-project/platforms/c2000/mcal/f28p65/code/inc/hw_epwm.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the TZCTLDCB register
//
//*************************************************************************************************
#define EPWM_TZCTLDCB_DCBEVT1U_S   0U
#define EPWM_TZCTLDCB_DCBEVT1U_M   0x7U     // DCBEVT1 Action On EPWMxA while Count direction is UP
#define EPWM_TZCTLDCB_DCBEVT1D_S   3U
#define EPWM_TZCTLDCB_DCBEVT1D_M   0x38U    // DCBEVT1 Action On EPWMxA while Count direction is
                                            // DOWN
#define EPWM_TZCTLDCB_DCBEVT2U_S   6U
#define EPWM_TZCTLDCB_DCBEVT2U_M   0x1C0U   // DCBEVT2 Action On EPWMxA while Count direction is UP
#define EPWM_TZCTLDCB_DCBEVT2D_S   9U
#define EPWM_TZCTLDCB_DCBEVT2D_M   0xE00U   // DCBEVT2 Action On EPWMxA while Count direction is
                                            // DOWN

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZEINT register
//
//*************************************************************************************************
#define EPWM_TZEINT_CBC       0x2U    // Trip Zones Cycle By Cycle Int Enable
#define EPWM_TZEINT_OST       0x4U    // Trip Zones One Shot Int Enable
#define EPWM_TZEINT_DCAEVT1   0x8U    // Digital Compare A Event 1 Int Enable
#define EPWM_TZEINT_DCAEVT2   0x10U   // Digital Compare A Event 2 Int Enable
#define EPWM_TZEINT_DCBEVT1   0x20U   // Digital Compare B Event 1 Int Enable
#define EPWM_TZEINT_DCBEVT2   0x40U   // Digital Compare B Event 2 Int Enable
#define EPWM_TZEINT_CAPEVT    0x80U   // Capture Eveent Interrupt Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZFLG register
//
//*************************************************************************************************
#define EPWM_TZFLG_INT       0x1U    // Global Int Status Flag
#define EPWM_TZFLG_CBC       0x2U    // Trip Zones Cycle By Cycle Flag
#define EPWM_TZFLG_OST       0x4U    // Trip Zones One Shot Flag
#define EPWM_TZFLG_DCAEVT1   0x8U    // Digital Compare A Event 1 Flag
#define EPWM_TZFLG_DCAEVT2   0x10U   // Digital Compare A Event 2 Flag
#define EPWM_TZFLG_DCBEVT1   0x20U   // Digital Compare B Event 1 Flag
#define EPWM_TZFLG_DCBEVT2   0x40U   // Digital Compare B Event 2 Flag
#define EPWM_TZFLG_CAPEVT    0x80U   // Capture Event Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZCBCFLG register
//
//*************************************************************************************************
#define EPWM_TZCBCFLG_CBC1      0x1U     // Latched Status Flag for CBC1 Trip Latch
#define EPWM_TZCBCFLG_CBC2      0x2U     // Latched Status Flag for CBC2 Trip Latch
#define EPWM_TZCBCFLG_CBC3      0x4U     // Latched Status Flag for CBC3 Trip Latch
#define EPWM_TZCBCFLG_CBC4      0x8U     // Latched Status Flag for CBC4 Trip Latch
#define EPWM_TZCBCFLG_CBC5      0x10U    // Latched Status Flag for CBC5 Trip Latch
#define EPWM_TZCBCFLG_CBC6      0x20U    // Latched Status Flag for CBC6 Trip Latch
#define EPWM_TZCBCFLG_DCAEVT2   0x40U    // Latched Status Flag for Digital Compare Output A Event
                                         // 2
#define EPWM_TZCBCFLG_DCBEVT2   0x80U    // Latched Status Flag for Digital Compare Output B Event
                                         // 2
#define EPWM_TZCBCFLG_CAPEVT    0x100U   // Capture Event Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZOSTFLG register
//
//*************************************************************************************************
#define EPWM_TZOSTFLG_OST1      0x1U     // Latched Status Flag for OST1 Trip Latch
#define EPWM_TZOSTFLG_OST2      0x2U     // Latched Status Flag for OST2 Trip Latch
#define EPWM_TZOSTFLG_OST3      0x4U     // Latched Status Flag for OST3 Trip Latch
#define EPWM_TZOSTFLG_OST4      0x8U     // Latched Status Flag for OST4 Trip Latch
#define EPWM_TZOSTFLG_OST5      0x10U    // Latched Status Flag for OST5 Trip Latch
#define EPWM_TZOSTFLG_OST6      0x20U    // Latched Status Flag for OST6 Trip Latch
#define EPWM_TZOSTFLG_DCAEVT1   0x40U    // Latched Status Flag for Digital Compare Output A Event
                                         // 1
#define EPWM_TZOSTFLG_DCBEVT1   0x80U    // Latched Status Flag for Digital Compare Output B Event
                                         // 1
#define EPWM_TZOSTFLG_CAPEVT    0x100U   // Capture Event Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZCLR register
//
//*************************************************************************************************
#define EPWM_TZCLR_INT          0x1U      // Global Interrupt Clear Flag
#define EPWM_TZCLR_CBC          0x2U      // Cycle-By-Cycle Flag Clear
#define EPWM_TZCLR_OST          0x4U      // One-Shot Flag Clear
#define EPWM_TZCLR_DCAEVT1      0x8U      // DCAVET1 Flag Clear
#define EPWM_TZCLR_DCAEVT2      0x10U     // DCAEVT2 Flag Clear
#define EPWM_TZCLR_DCBEVT1      0x20U     // DCBEVT1 Flag Clear
#define EPWM_TZCLR_DCBEVT2      0x40U     // DCBEVT2 Flag Clear
#define EPWM_TZCLR_CAPEVT       0x80U     // Capture Event Clear
#define EPWM_TZCLR_CBCPULSE_S   14U
#define EPWM_TZCLR_CBCPULSE_M   0xC000U   // Clear Pulse for CBC Trip Latch

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZCBCCLR register
//
//*************************************************************************************************
#define EPWM_TZCBCCLR_CBC1      0x1U     // Clear Flag for Cycle-By-Cycle (CBC1) Trip Latch
#define EPWM_TZCBCCLR_CBC2      0x2U     // Clear Flag for Cycle-By-Cycle (CBC2) Trip Latch
#define EPWM_TZCBCCLR_CBC3      0x4U     // Clear Flag for Cycle-By-Cycle (CBC3) Trip Latch
#define EPWM_TZCBCCLR_CBC4      0x8U     // Clear Flag for Cycle-By-Cycle (CBC4) Trip Latch
#define EPWM_TZCBCCLR_CBC5      0x10U    // Clear Flag for Cycle-By-Cycle (CBC5) Trip Latch
#define EPWM_TZCBCCLR_CBC6      0x20U    // Clear Flag for Cycle-By-Cycle (CBC6) Trip Latch
#define EPWM_TZCBCCLR_DCAEVT2   0x40U    // Clear Flag forDCAEVT2 selected for CBC
#define EPWM_TZCBCCLR_DCBEVT2   0x80U    // Clear Flag for DCBEVT2 selected for CBC
#define EPWM_TZCBCCLR_CAPEVT    0x100U   // Clear Flag for CAPEVT selected for CBC

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZOSTCLR register
//
//*************************************************************************************************
#define EPWM_TZOSTCLR_OST1      0x1U     // Clear Flag for Oneshot (OST1) Trip Latch
#define EPWM_TZOSTCLR_OST2      0x2U     // Clear Flag for Oneshot (OST2) Trip Latch
#define EPWM_TZOSTCLR_OST3      0x4U     // Clear Flag for Oneshot (OST3) Trip Latch
#define EPWM_TZOSTCLR_OST4      0x8U     // Clear Flag for Oneshot (OST4) Trip Latch
#define EPWM_TZOSTCLR_OST5      0x10U    // Clear Flag for Oneshot (OST5) Trip Latch
#define EPWM_TZOSTCLR_OST6      0x20U    // Clear Flag for Oneshot (OST6) Trip Latch
#define EPWM_TZOSTCLR_DCAEVT1   0x40U    // Clear Flag for DCAEVT1 selected for OST
#define EPWM_TZOSTCLR_DCBEVT1   0x80U    // Clear Flag for DCBEVT1 selected for OST
#define EPWM_TZOSTCLR_CAPEVT    0x100U   // Clear Flag for CAPEVT selected for OST

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZFRC register
//
//*************************************************************************************************
#define EPWM_TZFRC_CBC       0x2U    // Force Trip Zones Cycle By Cycle Event
#define EPWM_TZFRC_OST       0x4U    // Force Trip Zones One Shot Event
#define EPWM_TZFRC_DCAEVT1   0x8U    // Force Digital Compare A Event 1
#define EPWM_TZFRC_DCAEVT2   0x10U   // Force Digital Compare A Event 2
#define EPWM_TZFRC_DCBEVT1   0x20U   // Force Digital Compare B Event 1
#define EPWM_TZFRC_DCBEVT2   0x40U   // Force Digital Compare B Event 2
#define EPWM_TZFRC_CAPEVT    0x80U   // Force Capture Event

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZTRIPOUTSEL register
//
//*************************************************************************************************
#define EPWM_TZTRIPOUTSEL_OST       0x1U      // OST TRIPOUT select
#define EPWM_TZTRIPOUTSEL_CBC       0x2U      // CBC TRIPOUT select
#define EPWM_TZTRIPOUTSEL_TZ1       0x4U      // TZ1 TRIPOUT select
#define EPWM_TZTRIPOUTSEL_TZ2       0x8U      // TZ2 TRIPOUT select
#define EPWM_TZTRIPOUTSEL_TZ3       0x10U     // TZ3 TRIPOUT select
#define EPWM_TZTRIPOUTSEL_TZ4       0x20U     // TZ4 TRIPOUT select
#define EPWM_TZTRIPOUTSEL_TZ5       0x40U     // TZ5 TRIPOUT select
#define EPWM_TZTRIPOUTSEL_TZ6       0x80U     // TZ6 TRIPOUT select
#define EPWM_TZTRIPOUTSEL_DCAEVT1   0x100U    // DCAEVT1.force TRIPOUT select
#define EPWM_TZTRIPOUTSEL_DCAEVT2   0x200U    // DCAEVT2.force TRIPOUT select
#define EPWM_TZTRIPOUTSEL_DCBEVT1   0x400U    // DCBEVT1.force TRIPOUT select
#define EPWM_TZTRIPOUTSEL_DCBEVT2   0x800U    // DCBEVT2.force TRIPOUT select
#define EPWM_TZTRIPOUTSEL_CAPEVT    0x1000U   // CAPEVT TRIPOUT select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETSEL register
//
//*************************************************************************************************
#define EPWM_ETSEL_INTSEL_S     0U
#define EPWM_ETSEL_INTSEL_M     0x7U      // EPWMxINTn Select
#define EPWM_ETSEL_INTEN        0x8U      // EPWMxINTn Enable
#define EPWM_ETSEL_SOCASELCMP   0x10U     // EPWMxSOCA Compare Select
#define EPWM_ETSEL_SOCBSELCMP   0x20U     // EPWMxSOCB Compare Select
#define EPWM_ETSEL_INTSELCMP    0x40U     // EPWMxINT Compare Select
#define EPWM_ETSEL_SOCASEL_S    8U
#define EPWM_ETSEL_SOCASEL_M    0x700U    // Start of Conversion A Select
#define EPWM_ETSEL_SOCAEN       0x800U    // Start of Conversion A Enable
#define EPWM_ETSEL_SOCBSEL_S    12U
#define EPWM_ETSEL_SOCBSEL_M    0x7000U   // Start of Conversion B Select
#define EPWM_ETSEL_SOCBEN       0x8000U   // Start of Conversion B Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETPS register
//
//*************************************************************************************************
#define EPWM_ETPS_INTPRD_S    0U
#define EPWM_ETPS_INTPRD_M    0x3U      // EPWMxINTn Period Select
#define EPWM_ETPS_INTCNT_S    2U
#define EPWM_ETPS_INTCNT_M    0xCU      // EPWMxINTn Counter Register
#define EPWM_ETPS_INTPSSEL    0x10U     // EPWMxINTn Pre-Scale Selection Bits
#define EPWM_ETPS_SOCPSSEL    0x20U     // EPWMxSOC A/B  Pre-Scale Selection Bits
#define EPWM_ETPS_SOCAPRD_S   8U
#define EPWM_ETPS_SOCAPRD_M   0x300U    // EPWMxSOCA Period Select
#define EPWM_ETPS_SOCACNT_S   10U
#define EPWM_ETPS_SOCACNT_M   0xC00U    // EPWMxSOCA Counter Register
#define EPWM_ETPS_SOCBPRD_S   12U
#define EPWM_ETPS_SOCBPRD_M   0x3000U   // EPWMxSOCB Period Select
#define EPWM_ETPS_SOCBCNT_S   14U
#define EPWM_ETPS_SOCBCNT_M   0xC000U   // EPWMxSOCB Counter

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETFLG register
//
//*************************************************************************************************
#define EPWM_ETFLG_INT    0x1U   // EPWMxINTn Flag
#define EPWM_ETFLG_SOCA   0x4U   // EPWMxSOCA Flag
#define EPWM_ETFLG_SOCB   0x8U   // EPWMxSOCB Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETCLR register
//
//*************************************************************************************************
#define EPWM_ETCLR_INT    0x1U   // EPWMxINTn Clear
#define EPWM_ETCLR_SOCA   0x4U   // EPWMxSOCA Clear
#define EPWM_ETCLR_SOCB   0x8U   // EPWMxSOCB Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETFRC register
//
//*************************************************************************************************
#define EPWM_ETFRC_INT    0x1U   // EPWMxINTn Force
#define EPWM_ETFRC_SOCA   0x4U   // EPWMxSOCA Force
#define EPWM_ETFRC_SOCB   0x8U   // EPWMxSOCB Force

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETINTPS register
//
//*************************************************************************************************
#define EPWM_ETINTPS_INTPRD2_S   0U
#define EPWM_ETINTPS_INTPRD2_M   0xFU    // EPWMxINTn Period Select
#define EPWM_ETINTPS_INTCNT2_S   4U
#define EPWM_ETINTPS_INTCNT2_M   0xF0U   // EPWMxINTn Counter Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETSOCPS register
//
//*************************************************************************************************
#define EPWM_ETSOCPS_SOCAPRD2_S   0U
#define EPWM_ETSOCPS_SOCAPRD2_M   0xFU      // EPWMxSOCA Period Select
#define EPWM_ETSOCPS_SOCACNT2_S   4U
#define EPWM_ETSOCPS_SOCACNT2_M   0xF0U     // EPWMxSOCA Counter Register
#define EPWM_ETSOCPS_SOCBPRD2_S   8U
#define EPWM_ETSOCPS_SOCBPRD2_M   0xF00U    // EPWMxSOCB Period Select
#define EPWM_ETSOCPS_SOCBCNT2_S   12U
#define EPWM_ETSOCPS_SOCBCNT2_M   0xF000U   // EPWMxSOCB Counter Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETCNTINITCTL register
//
//*************************************************************************************************
#define EPWM_ETCNTINITCTL_INTINITFRC    0x400U    // EPWMxINT Counter Initialization Force
#define EPWM_ETCNTINITCTL_SOCAINITFRC   0x800U    // EPWMxSOCA Counter Initialization Force
#define EPWM_ETCNTINITCTL_SOCBINITFRC   0x1000U   // EPWMxSOCB Counter Initialization Force
#define EPWM_ETCNTINITCTL_INTINITEN     0x2000U   // EPWMxINT Counter Initialization Enable
#define EPWM_ETCNTINITCTL_SOCAINITEN    0x4000U   // EPWMxSOCA Counter Initialization Enable
#define EPWM_ETCNTINITCTL_SOCBINITEN    0x8000U   // EPWMxSOCB Counter Initialization Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETCNTINIT register
//
//*************************************************************************************************
#define EPWM_ETCNTINIT_INTINIT_S    0U
#define EPWM_ETCNTINIT_INTINIT_M    0xFU     // EPWMxINT Counter Initialization Bits
#define EPWM_ETCNTINIT_SOCAINIT_S   4U
#define EPWM_ETCNTINIT_SOCAINIT_M   0xF0U    // EPWMxSOCA Counter Initialization Bits
#define EPWM_ETCNTINIT_SOCBINIT_S   8U
#define EPWM_ETCNTINIT_SOCBINIT_M   0xF00U   // EPWMxSOCB Counter Initialization Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETINTMIXEN register
//
//*************************************************************************************************
#define EPWM_ETINTMIXEN_ZRO       0x1U     // Zero match enable to ETINTMIX
#define EPWM_ETINTMIXEN_PRD       0x2U     // Period match enable to ETINTMIX
#define EPWM_ETINTMIXEN_CAU       0x4U     // CMPA up-count match enable to ETINTMIX
#define EPWM_ETINTMIXEN_CAD       0x8U     // CMPA down-count match enable to ETINTMIX
#define EPWM_ETINTMIXEN_CBU       0x10U    // CMPB up-count match enable to ETINTMIX
#define EPWM_ETINTMIXEN_CBD       0x20U    // CMPB down-count match enable to ETINTMIX
#define EPWM_ETINTMIXEN_CCU       0x40U    // CMPC up-count match enable to ETINTMIX
#define EPWM_ETINTMIXEN_CCD       0x80U    // CMPC down-count match enable to ETINTMIX
#define EPWM_ETINTMIXEN_CDU       0x100U   // CMPD up-count match enable to ETINTMIX
#define EPWM_ETINTMIXEN_CDD       0x200U   // CMPD down-count match enable to ETINTMIX
#define EPWM_ETINTMIXEN_DCAEVT1   0x400U   // DCAEVT1.inter enable to ETINTMIX

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETSOCAMIXEN register
//
//*************************************************************************************************
#define EPWM_ETSOCAMIXEN_ZRO       0x1U     // Zero match enable to ETSOCAMIX
#define EPWM_ETSOCAMIXEN_PRD       0x2U     // Period match enable to ETSOCAMIX
#define EPWM_ETSOCAMIXEN_CAU       0x4U     // CMPA up-count match enable to ETSOCAMIX
#define EPWM_ETSOCAMIXEN_CAD       0x8U     // CMPA down-count match enable to ETSOCAMIX
#define EPWM_ETSOCAMIXEN_CBU       0x10U    // CMPB up-count match enable to ETSOCAMIX
#define EPWM_ETSOCAMIXEN_CBD       0x20U    // CMPB down-count match enable to ETSOCAMIX
#define EPWM_ETSOCAMIXEN_CCU       0x40U    // CMPC up-count match enable to ETSOCAMIX
#define EPWM_ETSOCAMIXEN_CCD       0x80U    // CMPC down-count match enable to ETSOCAMIX
#define EPWM_ETSOCAMIXEN_CDU       0x100U   // CMPD up-count match enable to ETSOCAMIX
#define EPWM_ETSOCAMIXEN_CDD       0x200U   // CMPD down-count match enable to ETSOCAMIX
#define EPWM_ETSOCAMIXEN_DCAEVT1   0x400U   // DCAEVT1.inter enable to ETSOCAMIX

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETSOCBMIXEN register
//
//*************************************************************************************************
#define EPWM_ETSOCBMIXEN_ZRO       0x1U     // Zero match enable to ETSOCBMIX
#define EPWM_ETSOCBMIXEN_PRD       0x2U     // Period match enable to ETSOCBMIX
#define EPWM_ETSOCBMIXEN_CAU       0x4U     // CMPA up-count match enable to ETSOCBMIX
#define EPWM_ETSOCBMIXEN_CAD       0x8U     // CMPA down-count match enable to ETSOCBMIX
#define EPWM_ETSOCBMIXEN_CBU       0x10U    // CMPB up-count match enable to ETSOCBMIX
#define EPWM_ETSOCBMIXEN_CBD       0x20U    // CMPB down-count match enable to ETSOCBMIX
#define EPWM_ETSOCBMIXEN_CCU       0x40U    // CMPC up-count match enable to ETSOCBMIX
#define EPWM_ETSOCBMIXEN_CCD       0x80U    // CMPC down-count match enable to ETSOCBMIX
#define EPWM_ETSOCBMIXEN_CDU       0x100U   // CMPD up-count match enable to ETSOCBMIX
#define EPWM_ETSOCBMIXEN_CDD       0x200U   // CMPD down-count match enable to ETSOCBMIX
#define EPWM_ETSOCBMIXEN_DCBEVT1   0x400U   // DCBEVT1.inter enable to ETSOCBMIX

//*************************************************************************************************
//
// The following are defines for the bit fields in the DCTRIPSEL register
//
//*************************************************************************************************
#define EPWM_DCTRIPSEL_DCAHCOMPSEL_S   0U
#define EPWM_DCTRIPSEL_DCAHCOMPSEL_M   0xFU      // Digital Compare A High COMP Input Select
#define EPWM_DCTRIPSEL_DCALCOMPSEL_S   4U
#define EPWM_DCTRIPSEL_DCALCOMPSEL_M   0xF0U     // Digital Compare A Low COMP Input Select
#define EPWM_DCTRIPSEL_DCBHCOMPSEL_S   8U
#define EPWM_DCTRIPSEL_DCBHCOMPSEL_M   0xF00U    // Digital Compare B High COMP Input Select
#define EPWM_DCTRIPSEL_DCBLCOMPSEL_S   12U
#define EPWM_DCTRIPSEL_DCBLCOMPSEL_M   0xF000U   // Digital Compare B Low COMP Input Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the DCACTL register
//
//*************************************************************************************************
#define EPWM_DCACTL_EVT1SRCSEL        0x1U      // DCAEVT1 Source Signal
#define EPWM_DCACTL_EVT1FRCSYNCSEL    0x2U      // DCAEVT1 Force Sync Signal
#define EPWM_DCACTL_EVT1SOCE          0x4U      // DCAEVT1 SOC Enable
#define EPWM_DCACTL_EVT1SYNCE         0x8U      // DCAEVT1 SYNC Enable
#define EPWM_DCACTL_EVT1LATSEL        0x10U     // DCAEVT1 Latched signal select
#define EPWM_DCACTL_EVT1LATCLRSEL_S   5U
#define EPWM_DCACTL_EVT1LATCLRSEL_M   0x60U     // DCAEVT1 Latched clear source select
#define EPWM_DCACTL_EVT1LAT           0x80U     // Indicates the status of DCAEVT1LAT signal.
#define EPWM_DCACTL_EVT2SRCSEL        0x100U    // DCAEVT2 Source Signal
#define EPWM_DCACTL_EVT2FRCSYNCSEL    0x200U    // DCAEVT2 Force Sync Signal
#define EPWM_DCACTL_EVT2LATSEL        0x1000U   // DCAEVT2 Latched signal select
#define EPWM_DCACTL_EVT2LATCLRSEL_S   13U
#define EPWM_DCACTL_EVT2LATCLRSEL_M   0x6000U   // DCAEVT2 Latched clear source select
#define EPWM_DCACTL_EVT2LAT           0x8000U   // Indicates the status of DCAEVT2LAT signal.

//*************************************************************************************************
//
// The following are defines for the bit fields in the DCBCTL register
//
//*************************************************************************************************
#define EPWM_DCBCTL_EVT1SRCSEL        0x1U      // DCBEVT1 Source Signal
#define EPWM_DCBCTL_EVT1FRCSYNCSEL    0x2U      // DCBEVT1 Force Sync Signal
#define EPWM_DCBCTL_EVT1SOCE          0x4U      // DCBEVT1 SOC Enable
#define EPWM_DCBCTL_EVT1SYNCE         0x8U      // DCBEVT1 SYNC Enable
#define EPWM_DCBCTL_EVT1LATSEL        0x10U     // DCBEVT1 Latched signal select
#define EPWM_DCBCTL_EVT1LATCLRSEL_S   5U
#define EPWM_DCBCTL_EVT1LATCLRSEL_M   0x60U     // DCBEVT1 Latched clear source select
#define EPWM_DCBCTL_EVT1LAT           0x80U     // Indicates the status of DCBEVT1LAT signal.
#define EPWM_DCBCTL_EVT2SRCSEL        0x100U    // DCBEVT2 Source Signal
#define EPWM_DCBCTL_EVT2FRCSYNCSEL    0x200U    // DCBEVT2 Force Sync Signal
#define EPWM_DCBCTL_EVT2LATSEL        0x1000U   // DCBEVT2 Latched signal select
#define EPWM_DCBCTL_EVT2LATCLRSEL_S   13U
#define EPWM_DCBCTL_EVT2LATCLRSEL_M   0x6000U   // DCBEVT2 Latched clear source select
#define EPWM_DCBCTL_EVT2LAT           0x8000U   // Indicates the status of DCBEVT2LAT signal.

